# Objective: To implement various data flow transformations that are commonly used in ETL(Extract, Load, Transform) process

#### Name: Alakshendra Pratap Singh
#### Prn: 22070521068
#### Sec: A
#### Sem: 6

In [7]:
import pandas as pd

#### Input Data

In [10]:
data = {
    'ID' : [1, 2, 3, 4, 5, 6],
    'Name' : ['Ambar', 'Ankush', 'Tirthak', 'Deepak', 'Aditya', 'Nishant'],
    'Age' : [19, 21, 20, 22, 18, 24],
    'Country' : ['Maharashtra', 'Karnatka', 'Gujrat', 'Uttar Pradesh', 'Goa', 'Chandigarh'],
    'Sales' : [300, 400, 200, 250, 500, 850]
}

In [65]:
# Create DataFrame
df = pd.DataFrame(data)
print('Original Dataset:')
df

Original Dataset:

   ID     Name  Age        Country  Sales
0   1    Ambar   19    Maharashtra    300
1   2   Ankush   21       Karnatka    400
2   3  Tirthak   20         Gujrat    200
3   4   Deepak   22  Uttar Pradesh    250
4   5   Aditya   18            Goa    500
5   6  Nishant   24     Chandigarh    850

## Data Flow Transformations

In [68]:
# Character Map
# Description: Transform text data by changing the case of characters. Here, we will convert the Name column to uppercase

In [70]:
# Character Map: COnvert 'Name' to uppercase
df['Name_Upper'] = df['Name'].str.upper()
print('\nCharacter Map (Uppercase Names):')
df[['ID', 'Name', 'Name_Upper']]

Character Map (Uppercase Names):

   ID     Name Name_Upper
0   1    Ambar      AMBAR
1   2   Ankush     ANKUSH
2   3  Tirthak    TIRTHAK
3   4   Deepak     DEEPAK
4   5   Aditya     ADITYA
5   6  Nishant    NISHANT

In [72]:
# Multicast: Create two copies of the dataset
df_copy1 = df.copy()
df_copy2 = df.copy()

# Transformations on each copy
df_copy1['Sales'] *= 1.1 # Increase sales by 10%
df_copy2['Age'] += 5 # Increase age by 5 years

print('\nMulticast (Modified Copies):')
print('\nCopy 1 (Sales Increased):')
print(df_copy1)
print('\nCopy 2 (Age Increased):')
print(df_copy2)

Multicast (Modified Copies):

Copy 1 (Sales Increased):
   ID     Name  Age        Country  Sales Name_Upper
0   1    Ambar   19    Maharashtra  330.0      AMBAR
1   2   Ankush   21       Karnatka  440.0     ANKUSH
2   3  Tirthak   20         Gujrat  220.0    TIRTHAK
3   4   Deepak   22  Uttar Pradesh  275.0     DEEPAK
4   5   Aditya   18            Goa  550.0     ADITYA
5   6  Nishant   24     Chandigarh  935.0    NISHANT

Copy 2 (Age Increased):
   ID     Name  Age        Country  Sales Name_Upper
0   1    Ambar   24    Maharashtra    300      AMBAR
1   2   Ankush   26       Karnatka    400     ANKUSH
2   3  Tirthak   25         Gujrat    200    TIRTHAK
3   4   Deepak   27  Uttar Pradesh    250     DEEPAK
4   5   Aditya   23            Goa    500     ADITYA
5   6  Nishant   29     Chandigarh    850    NISHANT

In [74]:
# 3. Conditional Split
# Description: Split data based on a condition. Here, we will separate rows with Sales > 300.

In [76]:
# Conditional Split: Sales > 300
high_sales = df[df['Sales'] > 300]
low_sales = df[df['Sales'] <= 300]
print('Conditional Split:')
print('\nHigh Sales:')
print(high_sales)
print('\nLow Sales:')
print(low_sales)

Conditional Split:

High Sales:
   ID     Name  Age     Country  Sales Name_Upper
1   2   Ankush   21    Karnatka    400     ANKUSH
4   5   Aditya   18         Goa    500     ADITYA
5   6  Nishant   24  Chandigarh    850    NISHANT

Low Sales:
   ID     Name  Age        Country  Sales Name_Upper
0   1    Ambar   19    Maharashtra    300      AMBAR
2   3  Tirthak   20         Gujrat    200    TIRTHAK
3   4   Deepak   22  Uttar Pradesh    250     DEEPAK

In [78]:
# Aggregation
# Description: Aggregate data, e.g., calculate total sales by country.
# Aggregation: Total sales by Country
agg_df = df.groupby('Country')['Sales'].sum().reset_index()
print('Aggregation (Total Sales by Country):')
agg_df

Aggregation (Total Sales by Country):

         Country  Sales
0     Chandigarh    850
1            Goa    500
2         Gujrat    200
3       Karnatka    400
4    Maharashtra    300
5  Uttar Pradesh    250

In [80]:
# 5. Sort
# DEscription: Sort the dataset by Sales in descending order.
# Sort: Sort by Sales in descending order
sorted_df = df.sort_values(by = 'Sales', ascending = False)
print('Sort (Descending Sales):')
sorted_df

Sort (Descending Sales):

   ID     Name  Age        Country  Sales Name_Upper
5   6  Nishant   24     Chandigarh    850    NISHANT
4   5   Aditya   18            Goa    500     ADITYA
1   2   Ankush   21       Karnatka    400     ANKUSH
0   1    Ambar   19    Maharashtra    300      AMBAR
3   4   Deepak   22  Uttar Pradesh    250     DEEPAK
2   3  Tirthak   20         Gujrat    200    TIRTHAK

In [82]:
# 6. Derived Column
# Description: Create a new column by deriving information from existing data.

In [84]:
# Derived Column: Categorize sales as 'High' or 'Low'
df['Sales_Category'] = df['Sales'].apply(lambda x: 'High' if x > 300 else 'Low')
print('Derived Column (Sales Category):')
df[['ID', 'Name', 'Sales', 'Sales_Category']]

Derived Column (Sales Category):

   ID     Name  Sales Sales_Category
0   1    Ambar    300            Low
1   2   Ankush    400           High
2   3  Tirthak    200            Low
3   4   Deepak    250            Low
4   5   Aditya    500           High
5   6  Nishant    850           High